Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFM144.PIC
      <edc:SFRDef edc:_addr="0x1F800690" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="----------------n--nnnnnnn-nnnnn" edc:cname="NVMBWP" edc:desc="" edc:impl="0x9fdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1--1111111-11111" edc:name="NVMBWP" edc:nzwidth="32" edc:por="----------------1--1111111-11111" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UBWP0" edc:desc="" edc:mask="0x1" edc:name="UBWP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UBWP1" edc:desc="" edc:mask="0x1" edc:name="UBWP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UBWP2" edc:desc="" edc:mask="0x1" edc:name="UBWP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UBWP3" edc:desc="" edc:mask="0x1" edc:name="UBWP3" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UBWP4" edc:desc="" edc:mask="0x1" edc:name="UBWP4" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DBGWP" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="DBGWP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UBWPULOCK" edc:desc="" edc:mask="0x1" edc:name="UBWPULOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LBWP0" edc:desc="" edc:mask="0x1" edc:name="LBWP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LBWP1" edc:desc="" edc:mask="0x1" edc:name="LBWP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LBWP2" edc:desc="" edc:mask="0x1" edc:name="LBWP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LBWP3" edc:desc="" edc:mask="0x1" edc:name="LBWP3" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LBWP4" edc:desc="" edc:mask="0x1" edc:name="LBWP4" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="LBWPULOCK" edc:desc="" edc:mask="0x1" edc:name="LBWPULOCK" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8006A0" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="------------------------nn------" edc:cname="NVMCON2" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00------" edc:name="NVMCON2" edc:nzwidth="32" edc:por="------------------------00------" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SWAPLOCK" edc:mask="0x3" edc:name="SWAPLOCK" edc:nzwidth="0x2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:AdjustPoint edc:offset="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8006B0" edc:offset="0x150"/>
      <edc:SFRDef edc:_addr="0x1F800800" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-02674_wdt_upb_v1_32bit.Module" edc:_refcount="1" edc:access="wwwwwwwwwwwwwwwwn--rrrrr-------n" edc:cname="WDTCON" edc:desc="" edc:impl="0xffff9f01" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000x--xxxxx-------0" edc:name="WDTCON" edc:nzwidth="32" edc:por="0000000000000000x--xxxxx-------0" edc:portals="CLR SET INV" ltx:baseofperipheral="WDT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDTWINEN" edc:desc="" edc:mask="0x1" edc:name="WDTWINEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RUNDIV" edc:desc="" edc:mask="0x1f" edc:name="RUNDIV" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTCLRKEY" edc:desc="" edc:mask="0xffff" edc:name="WDTCLRKEY" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800810" edc:offset="0x1f0"/>
      <edc:SFRDef edc:_addr="0x1F800A00" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="----------------n---------------" edc:cname="DMTCON" edc:desc="" edc:impl="0x8000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---------------" edc:name="DMTCON" edc:nzwidth="32" edc:por="----------------0---------------" edc:portals="- - -" ltx:baseofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="15"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A10" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnn--------" edc:cname="DMTPRECLR" edc:desc="" edc:impl="0xff00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00000000--------" edc:name="DMTPRECLR" edc:nzwidth="32" edc:por="----------------00000000--------" edc:portals="- - -" ltx:memberofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="STEP1" edc:desc="" edc:mask="0xff" edc:name="STEP1" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A20" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="DMTCLR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="DMTCLR" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="- - -" ltx:memberofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP2" edc:desc="" edc:mask="0xff" edc:name="STEP2" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A30" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="------------------------rrr----r" edc:cname="DMTSTAT" edc:desc="" edc:impl="0xe1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------000----0" edc:name="DMTSTAT" edc:nzwidth="32" edc:por="------------------------000----0" edc:portals="- - -" ltx:memberofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WINOPN" edc:desc="" edc:mask="0x1" edc:name="WINOPN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DMTEVENT" edc:desc="" edc:mask="0x1" edc:name="DMTEVENT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BAD" edc:desc="" edc:mask="0x3" edc:name="BAD" edc:nzwidth="2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="BAD2" edc:desc="" edc:mask="0x1" edc:name="BAD2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BAD1" edc:desc="" edc:mask="0x1" edc:name="BAD1" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
