Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFM144.PIC
      <edc:SFRDef edc:_addr="0x1F810060" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IFS2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD5IF" edc:desc="" edc:mask="0x1" edc:name="ADCD5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD6IF" edc:desc="" edc:mask="0x1" edc:name="ADCD6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD7IF" edc:desc="" edc:mask="0x1" edc:name="ADCD7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD8IF" edc:desc="" edc:mask="0x1" edc:name="ADCD8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD9IF" edc:desc="" edc:mask="0x1" edc:name="ADCD9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD10IF" edc:desc="" edc:mask="0x1" edc:name="ADCD10IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD11IF" edc:desc="" edc:mask="0x1" edc:name="ADCD11IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD12IF" edc:desc="" edc:mask="0x1" edc:name="ADCD12IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD13IF" edc:desc="" edc:mask="0x1" edc:name="ADCD13IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD14IF" edc:desc="" edc:mask="0x1" edc:name="ADCD14IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD15IF" edc:desc="" edc:mask="0x1" edc:name="ADCD15IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD16IF" edc:desc="" edc:mask="0x1" edc:name="ADCD16IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD17IF" edc:desc="" edc:mask="0x1" edc:name="ADCD17IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD18IF" edc:desc="" edc:mask="0x1" edc:name="ADCD18IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD19IF" edc:desc="" edc:mask="0x1" edc:name="ADCD19IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD20IF" edc:desc="" edc:mask="0x1" edc:name="ADCD20IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD21IF" edc:desc="" edc:mask="0x1" edc:name="ADCD21IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD22IF" edc:desc="" edc:mask="0x1" edc:name="ADCD22IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD23IF" edc:desc="" edc:mask="0x1" edc:name="ADCD23IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD24IF" edc:desc="" edc:mask="0x1" edc:name="ADCD24IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD25IF" edc:desc="" edc:mask="0x1" edc:name="ADCD25IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD26IF" edc:desc="" edc:mask="0x1" edc:name="ADCD26IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD27IF" edc:desc="" edc:mask="0x1" edc:name="ADCD27IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD28IF" edc:desc="" edc:mask="0x1" edc:name="ADCD28IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD29IF" edc:desc="" edc:mask="0x1" edc:name="ADCD29IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD30IF" edc:desc="" edc:mask="0x1" edc:name="ADCD30IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD31IF" edc:desc="" edc:mask="0x1" edc:name="ADCD31IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD32IF" edc:desc="" edc:mask="0x1" edc:name="ADCD32IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD33IF" edc:desc="" edc:mask="0x1" edc:name="ADCD33IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD34IF" edc:desc="" edc:mask="0x1" edc:name="ADCD34IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD35IF" edc:desc="" edc:mask="0x1" edc:name="ADCD35IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD36IF" edc:desc="" edc:mask="0x1" edc:name="ADCD36IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810070" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnn-nnnnnnnnnnnn" edc:cname="IFS3" edc:desc="" edc:impl="0xffffefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000-000000000000" edc:name="IFS3" edc:nzwidth="32" edc:por="0000000000000000000-000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD37IF" edc:desc="" edc:mask="0x1" edc:name="ADCD37IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD38IF" edc:desc="" edc:mask="0x1" edc:name="ADCD38IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD39IF" edc:desc="" edc:mask="0x1" edc:name="ADCD39IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD40IF" edc:desc="" edc:mask="0x1" edc:name="ADCD40IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD41IF" edc:desc="" edc:mask="0x1" edc:name="ADCD41IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD42IF" edc:desc="" edc:mask="0x1" edc:name="ADCD42IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD43IF" edc:desc="" edc:mask="0x1" edc:name="ADCD43IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD44IF" edc:desc="" edc:mask="0x1" edc:name="ADCD44IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CPCIF" edc:desc="" edc:mask="0x1" edc:name="CPCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFDCIF" edc:desc="" edc:mask="0x1" edc:name="CFDCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SBIF" edc:desc="" edc:mask="0x1" edc:name="SBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CRPTIF" edc:desc="" edc:mask="0x1" edc:name="CRPTIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIF" edc:desc="" edc:mask="0x1" edc:name="I2C1BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:desc="" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:desc="" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:desc="" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIF" edc:desc="" edc:mask="0x1" edc:name="CNDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNEIF" edc:desc="" edc:mask="0x1" edc:name="CNEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNFIF" edc:desc="" edc:mask="0x1" edc:name="CNFIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNGIF" edc:desc="" edc:mask="0x1" edc:name="CNGIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNHIF" edc:desc="" edc:mask="0x1" edc:name="CNHIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNJIF" edc:desc="" edc:mask="0x1" edc:name="CNJIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNKIF" edc:desc="" edc:mask="0x1" edc:name="CNKIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810080" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IFS4" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMPIF" edc:desc="" edc:mask="0x1" edc:name="PMPIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMPEIF" edc:desc="" edc:mask="0x1" edc:name="PMPEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP1IF" edc:desc="" edc:mask="0x1" edc:name="CMP1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2IF" edc:desc="" edc:mask="0x1" edc:name="CMP2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="USBIF" edc:desc="" edc:mask="0x1" edc:name="USBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="USBDMAIF" edc:desc="" edc:mask="0x1" edc:name="USBDMAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:desc="" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IF" edc:desc="" edc:mask="0x1" edc:name="DMA4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IF" edc:desc="" edc:mask="0x1" edc:name="DMA5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IF" edc:desc="" edc:mask="0x1" edc:name="DMA6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IF" edc:desc="" edc:mask="0x1" edc:name="DMA7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2EIF" edc:desc="" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIF" edc:desc="" edc:mask="0x1" edc:name="I2C2BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIF" edc:desc="" edc:mask="0x1" edc:name="I2C2SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIF" edc:desc="" edc:mask="0x1" edc:name="I2C2MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN1IF" edc:desc="" edc:mask="0x1" edc:name="CAN1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN2IF" edc:desc="" edc:mask="0x1" edc:name="CAN2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ETHIF" edc:desc="" edc:mask="0x1" edc:name="ETHIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3EIF" edc:desc="" edc:mask="0x1" edc:name="SPI3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI3RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI3TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3EIF" edc:desc="" edc:mask="0x1" edc:name="U3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3RXIF" edc:desc="" edc:mask="0x1" edc:name="U3RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3TXIF" edc:desc="" edc:mask="0x1" edc:name="U3TXIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810090" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS5" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000000000000000000000000000" edc:name="IFS5" edc:nzwidth="32" edc:por="-0000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C3BIF" edc:desc="" edc:mask="0x1" edc:name="I2C3BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3SIF" edc:desc="" edc:mask="0x1" edc:name="I2C3SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MIF" edc:desc="" edc:mask="0x1" edc:name="I2C3MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4EIF" edc:desc="" edc:mask="0x1" edc:name="SPI4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI4RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI4TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:desc="" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FCEIF" edc:desc="" edc:mask="0x1" edc:name="FCEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PREIF" edc:desc="" edc:mask="0x1" edc:name="PREIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SQI1IF" edc:desc="" edc:mask="0x1" edc:name="SQI1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4EIF" edc:desc="" edc:mask="0x1" edc:name="U4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4RXIF" edc:desc="" edc:mask="0x1" edc:name="U4RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4TXIF" edc:desc="" edc:mask="0x1" edc:name="U4TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4BIF" edc:desc="" edc:mask="0x1" edc:name="I2C4BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4SIF" edc:desc="" edc:mask="0x1" edc:name="I2C4SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4MIF" edc:desc="" edc:mask="0x1" edc:name="I2C4MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5EIF" edc:desc="" edc:mask="0x1" edc:name="SPI5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI5RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI5TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5EIF" edc:desc="" edc:mask="0x1" edc:name="U5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5RXIF" edc:desc="" edc:mask="0x1" edc:name="U5RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5TXIF" edc:desc="" edc:mask="0x1" edc:name="U5TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5BIF" edc:desc="" edc:mask="0x1" edc:name="I2C5BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5SIF" edc:desc="" edc:mask="0x1" edc:name="I2C5SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5MIF" edc:desc="" edc:mask="0x1" edc:name="I2C5MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6IF" edc:desc="" edc:mask="0x1" edc:name="SPI6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI6RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6TX" edc:desc="" edc:mask="0x1" edc:name="SPI6TX" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6EIF" edc:desc="" edc:mask="0x1" edc:name="U6EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6RXIF" edc:desc="" edc:mask="0x1" edc:name="U6RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6TXIF" edc:desc="" edc:mask="0x1" edc:name="U6TXIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100A0" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="----------n--nnnnnn--nnnnn-n-nnn" edc:cname="IFS6" edc:desc="" edc:impl="0x27e7d7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------0--000000--00000-0-000" edc:name="IFS6" edc:nzwidth="32" edc:por="----------0--000000--00000-0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCEOSIF" edc:mask="0x1" edc:name="ADCEOSIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCARDYIF" edc:mask="0x1" edc:name="ADCARDYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCURDYIF" edc:mask="0x1" edc:name="ADCURDYIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCGRPIF" edc:mask="0x1" edc:name="ADCGRPIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADC0EIF" edc:mask="0x1" edc:name="ADC0EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1EIF" edc:mask="0x1" edc:name="ADC1EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC2EIF" edc:mask="0x1" edc:name="ADC2EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC3EIF" edc:mask="0x1" edc:name="ADC3EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC4EIF" edc:mask="0x1" edc:name="ADC4EIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADC7EIF" edc:mask="0x1" edc:name="ADC7EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC0WIF" edc:mask="0x1" edc:name="ADC0WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1WIF" edc:mask="0x1" edc:name="ADC1WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC2WIF" edc:mask="0x1" edc:name="ADC2WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC3WIF" edc:mask="0x1" edc:name="ADC3WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC4WIF" edc:mask="0x1" edc:name="ADC4WIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADC7WIF" edc:mask="0x1" edc:name="ADC7WIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
