Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFM144.PIC
      <edc:SFRDef edc:_addr="0x1F84B100" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="25" edc:access="----nnnnn--nnnnnr--rrrrrn--nnnnn" edc:cname="ADCANCON" edc:desc="" edc:impl="0xf9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----00000--000000--000000--00000" edc:name="ADCANCON" edc:nzwidth="32" edc:por="----00000--000000--000000--00000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANEN0" edc:mask="0x1" edc:name="ANEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN1" edc:mask="0x1" edc:name="ANEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN2" edc:mask="0x1" edc:name="ANEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN3" edc:mask="0x1" edc:name="ANEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN4" edc:mask="0x1" edc:name="ANEN4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANEN7" edc:mask="0x1" edc:name="ANEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY0" edc:mask="0x1" edc:name="WKRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY1" edc:mask="0x1" edc:name="WKRDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY2" edc:mask="0x1" edc:name="WKRDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY3" edc:mask="0x1" edc:name="WKRDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY4" edc:mask="0x1" edc:name="WKRDY4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="WKRDY7" edc:mask="0x1" edc:name="WKRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN0" edc:mask="0x1" edc:name="WKIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN1" edc:mask="0x1" edc:name="WKIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN2" edc:mask="0x1" edc:name="WKIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN3" edc:mask="0x1" edc:name="WKIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN4" edc:mask="0x1" edc:name="WKIEN4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="WKIEN7" edc:mask="0x1" edc:name="WKIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPCLKCNT" edc:mask="0xf" edc:name="WKUPCLKCNT" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F84B104" edc:offset="0x7C"/>
      <edc:SFRDef edc:_addr="0x1F84B180" edc:_begin="0xa0" edc:_end="0xb4" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="26" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC0CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC0CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B184" edc:_begin="0xa0" edc:_end="0xb4" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="26" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC1CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC1CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B188" edc:_begin="0xa0" edc:_end="0xb4" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="26" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC2CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC2CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B18C" edc:_begin="0xa0" edc:_end="0xb4" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="26" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC3CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC3CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B190" edc:_begin="0xa0" edc:_end="0xb4" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="26" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC4CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC4CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F84B194" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x1F84B19C" edc:_begin="0xbc" edc:_end="0xc0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="27" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC7CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC7CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F84B1A0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F84B1C0" edc:_begin="0xc0" edc:_end="0xc8" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="28" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADCSYSCFG0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCSYSCFG0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AN0" edc:mask="0x1" edc:name="AN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN1" edc:mask="0x1" edc:name="AN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN2" edc:mask="0x1" edc:name="AN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN3" edc:mask="0x1" edc:name="AN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN4" edc:mask="0x1" edc:name="AN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN5" edc:mask="0x1" edc:name="AN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN6" edc:mask="0x1" edc:name="AN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN7" edc:mask="0x1" edc:name="AN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN8" edc:mask="0x1" edc:name="AN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN9" edc:mask="0x1" edc:name="AN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN10" edc:mask="0x1" edc:name="AN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN11" edc:mask="0x1" edc:name="AN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN12" edc:mask="0x1" edc:name="AN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN13" edc:mask="0x1" edc:name="AN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN14" edc:mask="0x1" edc:name="AN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN15" edc:mask="0x1" edc:name="AN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN16" edc:mask="0x1" edc:name="AN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN17" edc:mask="0x1" edc:name="AN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN18" edc:mask="0x1" edc:name="AN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN19" edc:mask="0x1" edc:name="AN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN20" edc:mask="0x1" edc:name="AN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN21" edc:mask="0x1" edc:name="AN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN22" edc:mask="0x1" edc:name="AN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN23" edc:mask="0x1" edc:name="AN23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN24" edc:mask="0x1" edc:name="AN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN25" edc:mask="0x1" edc:name="AN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN26" edc:mask="0x1" edc:name="AN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN27" edc:mask="0x1" edc:name="AN27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN28" edc:mask="0x1" edc:name="AN28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN29" edc:mask="0x1" edc:name="AN29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN30" edc:mask="0x1" edc:name="AN30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN31" edc:mask="0x1" edc:name="AN31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B1C4" edc:_begin="0xc0" edc:_end="0xc8" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="28" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADCSYSCFG1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCSYSCFG1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AN32" edc:mask="0x1" edc:name="AN32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN33" edc:mask="0x1" edc:name="AN33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN34" edc:mask="0x1" edc:name="AN34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN35" edc:mask="0x1" edc:name="AN35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN36" edc:mask="0x1" edc:name="AN36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN37" edc:mask="0x1" edc:name="AN37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN38" edc:mask="0x1" edc:name="AN38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN39" edc:mask="0x1" edc:name="AN39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN40" edc:mask="0x1" edc:name="AN40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN41" edc:mask="0x1" edc:name="AN41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN42" edc:mask="0x1" edc:name="AN42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN43" edc:mask="0x1" edc:name="AN43" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN44" edc:mask="0x1" edc:name="AN44" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN45" edc:mask="0x1" edc:name="AN45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN46" edc:mask="0x1" edc:name="AN46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN47" edc:mask="0x1" edc:name="AN47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN48" edc:mask="0x1" edc:name="AN48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN49" edc:mask="0x1" edc:name="AN49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN50" edc:mask="0x1" edc:name="AN50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN51" edc:mask="0x1" edc:name="AN51" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN52" edc:mask="0x1" edc:name="AN52" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN53" edc:mask="0x1" edc:name="AN53" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN54" edc:mask="0x1" edc:name="AN54" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN55" edc:mask="0x1" edc:name="AN55" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN56" edc:mask="0x1" edc:name="AN56" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN57" edc:mask="0x1" edc:name="AN57" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN58" edc:mask="0x1" edc:name="AN58" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN59" edc:mask="0x1" edc:name="AN59" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN60" edc:mask="0x1" edc:name="AN60" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN61" edc:mask="0x1" edc:name="AN61" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN62" edc:mask="0x1" edc:name="AN62" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN63" edc:mask="0x1" edc:name="AN63" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
